SQL/Active Record/DoggyDayCare/app/models/toy.rb

SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def dog
    Dog.find(dog_id)